In [2]:
import pandas as pd
import numpy as np

In [6]:
d={"name":['Kedar','Rohan','Vaibhav','Nishad','Akshay'],
    "marks":[96,56,65,33,25],
    "city":['Pune','Satara','Bhor','Mumbai','Khadkwasala']
  }

In [7]:
df=pd.DataFrame(data=d)

In [8]:
df

      name  marks         city
0    Kedar     96         Pune
1    Rohan     56       Satara
2  Vaibhav     65         Bhor
3   Nishad     33       Mumbai
4   Akshay     25  Khadkwasala

In [11]:
df.to_csv('Data.csv')
df

      name  marks         city
0    Kedar     96         Pune
1    Rohan     56       Satara
2  Vaibhav     65         Bhor
3   Nishad     33       Mumbai
4   Akshay     25  Khadkwasala

In [12]:
df.to_csv('Data1.csv',index=False)

In [59]:
data.head(3)

   Train no  Speed    City
0     12344    200    Pune
1    123444     56  Satara
2     56899     65    Bhor

In [60]:
data.describe()

            Train no       Speed
count       5.000000    5.000000
mean    72227.400000   75.800000
std     42239.686674   71.321105
min     12344.000000   25.000000
25%     56899.000000   33.000000
50%     69999.000000   56.000000
75%     98451.000000   65.000000
max    123444.000000  200.000000

In [62]:
data=pd.read_csv('Train.csv')
data

   Unnamed: 0  Train no  Speed         City
0           0     12344    200         Pune
1           1    123444     56       Satara
2           2     56899     65         Bhor
3           3     69999     33       Mumbai
4           4     98451     25  Khadkwasala

In [39]:
data['Speed'][0] =200

C:\Users\KEDAR\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [38]:
data['Train no'][1]

123444

In [40]:
data

   Train no  Speed         City
0     12344    200         Pune
1    123444     56       Satara
2     56899     65         Bhor
3     69999     33       Mumbai
4     98451     25  Khadkwasala

In [47]:
data.to_csv('Kedar.csv')

In [54]:
data

   Train no  Speed         City
0     12344    200         Pune
1    123444     56       Satara
2     56899     65         Bhor
3     69999     33       Mumbai
4     98451     25  Khadkwasala